# ------------------------------------------------------------------------------------
## [실습] 단의 숫자만큼 구구단 출력하세요
## 2 * 1 = 2  2 * 2 = 4
## 3 * 1 = 3  3 * 2 = 6     3 * 3 = 9
## 4 * 1 = 4  4 * 2 = 8     4 * 3 = 12     4 * 4 = 16
# -----------------------------------------------------------------------------------
isBreak = False
for d in range(2,10):
    print(f'\n[{d}단]',end='  ')
    for n in range (1,10):
        print(f'{d} * {n} = {d*n:<2}', end = '  ')
        if n==d :
            isBreak = True
            break
    print("outer for")
    if isBreak:break
